## Extract Datsets from mongo db

## Libraries

In [9]:
import pymongo

## Create a conection

In [10]:
client = pymongo.MongoClient('mongodb://127.0.0.1:27017/')
mydb = client['Employee']
empinfo= mydb.empinformation

### Extract database and collection details

In [11]:
empinfo.find_one()

{'_id': ObjectId('60d373e81260b0afa483e8ab'),
 'firstname': 'Krish',
 'lastname': 'Naik',
 'department': 'Analytics',
 'qualification': 'BE',
 'age': 29}

In [12]:
#Method 2
for record in empinfo.find({}):
    print(record)

{'_id': ObjectId('60d373e81260b0afa483e8ab'), 'firstname': 'Krish', 'lastname': 'Naik', 'department': 'Analytics', 'qualification': 'BE', 'age': 29}
{'_id': ObjectId('60d374381260b0afa483e8ac'), 'firstname': 'John', 'lastname': 'Doe', 'department': 'Analytics', 'qualification': 'statistics', 'age': 35}
{'_id': ObjectId('60d374381260b0afa483e8ad'), 'firstname': 'John ', 'lastname': 'Smith', 'department': 'Analytics', 'qualification': 'masters', 'age': 30}
{'_id': ObjectId('60d374381260b0afa483e8ae'), 'firstname': 'Manish', 'lastname': 'Sen', 'department': 'Analytics', 'qualification': 'phd', 'age': 34}
{'_id': ObjectId('60d374381260b0afa483e8af'), 'firstname': 'Ram', 'lastname': 'Singh', 'department': 'Analytics', 'qualification': 'master', 'age': 32}

### Extrac with pandas

In [13]:
import pandas as pd

In [14]:
df = pd.DataFrame(list(empinfo.find()))

In [15]:
df

                        _id firstname lastname department qualification  age
0  60d373e81260b0afa483e8ab     Krish     Naik  Analytics            BE   29
1  60d374381260b0afa483e8ac      John      Doe  Analytics    statistics   35
2  60d374381260b0afa483e8ad     John     Smith  Analytics       masters   30
3  60d374381260b0afa483e8ae    Manish      Sen  Analytics           phd   34
4  60d374381260b0afa483e8af       Ram    Singh  Analytics        master   32

In [16]:
df.shape

(5, 6)

### Another db

In [20]:
mydb = client['Empployee']
inventory = mydb.inventory

In [21]:
df2 = pd.DataFrame(list(inventory.find()))
df2

,_id,item,qty,size,status,lastModified,instock
0,60d396e964f65281a68131ef,canvas,100.0,"{'h': 28, 'w': 35.5, 'uom': 'cm'}",A,NaT,NaN
1,60d396e964f65281a68131f0,journal,25.0,"{'h': 14, 'w': 21, 'uom': 'in'}",P,2021-06-23 20:20:35.533,NaN
2,60d396e964f65281a68131f1,mat,85.0,"{'h': 27.9, 'w': 35.5, 'uom': 'cm'}",A,NaT,NaN
3,60d396e964f65281a68131f2,mousepad,25.0,"{'h': 19, 'w': 22.85, 'uom': 'in'}",P,2021-06-23 20:20:35.534,NaN
4,60d396e964f65281a68131f3,notebook,50.0,"{'h': 8.5, 'w': 11, 'uom': 'in'}",P,NaT,NaN
5,60d396e964f65281a68131f4,paper,NaN,NaN,NaN,NaT,"[{'warehouse': 'A', 'qty': 60}, {'warehouse': ..."
6,60d396e964f65281a68131f5,planner,75.0,"{'h': 22.85, 'w': 30, 'uom': 'cm'}",D,NaT,NaN
7,60d396e964f65281a68131f6,postcard,45.0,"{'h': 10, 'w': 15.25, 'uom': 'in'}",P,2021-06-23 20:20:35.534,NaN
8,60d396e964f65281a68131f7,sketchbook,80.0,"{'h': 14, 'w': 21, 'uom': 'cm'}",A,NaT,NaN
9,60d396e964f65281a68131f8,sketch pad,95.0,"{'h': 22.85, 'w': 30.5, 'uom': 'm'}",P,2021-06-23 20:20:07.247,NaN

In [22]:
df2.shape

(10, 7)

In [23]:
mydatabase = client['Students']

In [24]:
db = mydatabase.studentscores

In [25]:
df3 = pd.DataFrame(list(db.find()))
df3

                        _id   user     subject  score         title
0  60d3989005aaaca2474ef53c  Krish    Database     80           NaN
1  60d3989005aaaca2474ef53d   Amit  JavaScript     90           NaN
2  60d3989005aaaca2474ef53e   Amit         NaN     85      Database
3  60d3989005aaaca2474ef53f  Krish         NaN     75    JavaScript
4  60d3989005aaaca2474ef540   Amit         NaN     60  Data Science
5  60d3989005aaaca2474ef541  Krish         NaN     95  Data Science

In [26]:
df3.shape

(6, 5)